Revit 2024 API
PipingSystemType.FluidTemperature Property
 Fluid Temperature, in Kelvin.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public double FluidTemperature { get; set; }
Visual Basic
Public Property FluidTemperature As Double
	Get
	Set
Visual C++
public:
property double FluidTemperature {
	double get ();
	void set (double value);
}
See Also
PipingSystemType Class
Autodesk.Revit.DB.Plumbing Namespace